-- phpMyAdmin SQL Dump
-- version 5.2.0
-- https://www.phpmyadmin.net/
--
-- Host: 127.0.0.1
-- Generation Time: Dec 26, 2023 at 03:31 PM
-- Server version: 10.4.24-MariaDB
-- PHP Version: 8.1.6

SET SQL_MODE = "NO_AUTO_VALUE_ON_ZERO";
START TRANSACTION;
SET time_zone = "+00:00";


/*!40101 SET @OLD_CHARACTER_SET_CLIENT=@@CHARACTER_SET_CLIENT */;
/*!40101 SET @OLD_CHARACTER_SET_RESULTS=@@CHARACTER_SET_RESULTS */;
/*!40101 SET @OLD_COLLATION_CONNECTION=@@COLLATION_CONNECTION */;
/*!40101 SET NAMES utf8mb4 */;

--
-- Database: `dormitory`
--

-- --------------------------------------------------------

--
-- Table structure for table `การใช้น้ำใช้ไฟ`
--

CREATE TABLE `การใช้น้ำใช้ไฟ` (
  `เลขที่ห้องเช่า` int(3) NOT NULL,
  `วัน_เดือน_ปีที่จด` date NOT NULL,
  `เลขมิเตอร์น้ำเดือนปัจจุบัน` varchar(4) NOT NULL,
  `เลขมิเตอร์ไฟเดือนปัจจุบัน` varchar(5) NOT NULL,
  `เลขหน่วยน้ำที่ใช้` int(4) NOT NULL,
  `เลขหน่วยไฟที่ใช้` int(5) NOT NULL,
  `ราคาต่อหน่วยน้ำ` int(4) NOT NULL,
  `ราคาต่อหน่วยไฟ` int(4) NOT NULL,
  `ค่าน้ำ` float(10,2) NOT NULL,
  `ค่าไฟ` float(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `การใช้น้ำใช้ไฟ`
--

INSERT INTO `การใช้น้ำใช้ไฟ` (`เลขที่ห้องเช่า`, `วัน_เดือน_ปีที่จด`, `เลขมิเตอร์น้ำเดือนปัจจุบัน`, `เลขมิเตอร์ไฟเดือนปัจจุบัน`, `เลขหน่วยน้ำที่ใช้`, `เลขหน่วยไฟที่ใช้`, `ราคาต่อหน่วยน้ำ`, `ราคาต่อหน่วยไฟ`, `ค่าน้ำ`, `ค่าไฟ`) VALUES
(101, '2022-11-20', '0007', '00105', 7, 105, 25, 7, 175.00, 735.00),
(102, '2022-11-20', '0010', '00109', 10, 109, 25, 7, 250.00, 763.00),
(103, '2022-11-20', '0010', '00250', 10, 250, 25, 7, 250.00, 1750.00),
(104, '2022-11-17', '0005', '00099', 5, 99, 25, 7, 125.00, 693.00),
(104, '2022-12-20', '0007', '00150', 2, 51, 25, 7, 50.00, 357.00),
(201, '1899-09-20', '0007', '00105', 7, 105, 25, 7, 175.00, 735.00),
(201, '2022-10-20', '0015', '00230', 8, 125, 25, 7, 200.00, 875.00),
(201, '2022-11-20', '0019', '00350', 4, 120, 25, 7, 100.00, 840.00),
(202, '2022-11-22', '0009', '00106', 9, 106, 25, 7, 225.00, 742.00),
(204, '2022-11-20', '0005', '00125', 5, 125, 25, 7, 125.00, 875.00);

-- --------------------------------------------------------

--
-- Table structure for table `ลูกค้า`
--

CREATE TABLE `ลูกค้า` (
  `เลขที่ห้องเช่า` int(3) NOT NULL,
  `เลขบัตรประชาชน` varchar(13) NOT NULL,
  `ชื่อ_นามสกุล` varchar(255) NOT NULL,
  `ที่อยู่` varchar(255) NOT NULL,
  `เบอร์โทรศัพท์` varchar(10) NOT NULL,
  `ระยะเวลาเช่า` varchar(3) NOT NULL,
  `เงินประกัน` float(10,2) NOT NULL,
  `ยอดค้างชำระ` float(10,2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `ลูกค้า`
--

INSERT INTO `ลูกค้า` (`เลขที่ห้องเช่า`, `เลขบัตรประชาชน`, `ชื่อ_นามสกุล`, `ที่อยู่`, `เบอร์โทรศัพท์`, `ระยะเวลาเช่า`, `เงินประกัน`, `ยอดค้างชำระ`) VALUES
(102, '0265339157478', 'ศรพงษ์ พงเพชร', '123/598 ซ.พงเพชร', '0986562511', '12', 5000.00, 5013.00),
(104, '1035287425644', 'ส้ม ตำ', 'ครก', '0232526845', '12', 5000.00, 0.00),
(201, '1122287766774', 'Somsak Samorn', 'ต.ปงยางคก อ.ห้างฉัตร ลำปาง 52190', '0875462154', '12', 5000.00, 0.00),
(202, '1165280967721', 'Scott Tiger', 'ต.นาววุ้ง อ.เมือง เพชรบุรี 58000', '0813335471', '5', 10000.00, 0.00),
(310, '1167737298778', 'Bryan Viper', 'ต.นาวสี อ.เมือง ราชบุรี 71000', '0644156288', '36', 20000.00, 0.00),
(204, '1231332312545', 'a', 'a', '0231231521', '12', 5000.00, 0.00),
(103, '1302055755555', 'a', '-', '0895986545', '12', 5000.00, 0.00),
(101, '1302585756875', 'หอวัง ศักดา', 'ซ.หอวัง', '0639299958', '12', 5000.00, 910.00);

-- --------------------------------------------------------

--
-- Table structure for table `ห้องเช่า`
--

CREATE TABLE `ห้องเช่า` (
  `เลขที่ห้องเช่า` int(3) NOT NULL,
  `ค่าห้อง` float(10,2) NOT NULL,
  `เลขมิเตอร์น้ำ` varchar(4) NOT NULL,
  `เลขมิเตอร์ไฟ` varchar(5) NOT NULL,
  `สถานะการเข้าอยู่` varchar(10) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `ห้องเช่า`
--

INSERT INTO `ห้องเช่า` (`เลขที่ห้องเช่า`, `ค่าห้อง`, `เลขมิเตอร์น้ำ`, `เลขมิเตอร์ไฟ`, `สถานะการเข้าอยู่`) VALUES
(101, 2000.00, '0007', '00105', 'ไม่ว่าง'),
(102, 2000.00, '0010', '00109', 'ไม่ว่าง'),
(103, 2000.00, '0010', '00250', 'ไม่ว่าง'),
(104, 2000.00, '0007', '00150', 'ไม่ว่าง'),
(105, 2000.00, '0001', '00001', 'ว่าง'),
(106, 2000.00, '0001', '00001', 'ว่าง'),
(201, 2000.00, '0019', '00350', 'ไม่ว่าง'),
(202, 2000.00, '0009', '00106', 'ไม่ว่าง'),
(203, 2000.00, '0000', '00000', 'ว่าง'),
(204, 2000.00, '0005', '00125', 'ไม่ว่าง'),
(205, 2000.00, '0000', '00000', 'ว่าง'),
(206, 2000.00, '0000', '00000', 'ว่าง'),
(301, 2000.00, '0000', '00000', 'ว่าง'),
(302, 2000.00, '0000', '00000', 'ว่าง'),
(303, 2000.00, '0000', '00000', 'ว่าง'),
(304, 2000.00, '0000', '00000', 'ว่าง'),
(305, 2000.00, '0000', '00000', 'ว่าง'),
(306, 2000.00, '0000', '00000', 'ว่าง'),
(310, 2000.00, '0000', '00000', 'ไม่ว่าง');

-- --------------------------------------------------------

--
-- Table structure for table `ใบเสร็จ`
--

CREATE TABLE `ใบเสร็จ` (
  `เลขที่ห้องเช่า` int(3) NOT NULL,
  `เลขที่ใบแจ้งหนี้` bigint(10) NOT NULL,
  `เลขที่ใบเสร็จ` bigint(10) NOT NULL,
  `วัน_เดือน_ปีที่ออกใบเสร็จ` date NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `ใบเสร็จ`
--

INSERT INTO `ใบเสร็จ` (`เลขที่ห้องเช่า`, `เลขที่ใบแจ้งหนี้`, `เลขที่ใบเสร็จ`, `วัน_เดือน_ปีที่ออกใบเสร็จ`) VALUES
(101, 10125112022, 1015122022, '2022-12-05'),
(103, 10325112022, 1035122022, '2022-12-05'),
(202, 20225112022, 2026122022, '2022-12-06'),
(204, 20425112022, 2045122022, '2022-12-05');

-- --------------------------------------------------------

--
-- Table structure for table `ใบแจ้งหนี้`
--

CREATE TABLE `ใบแจ้งหนี้` (
  `เลขที่ห้องเช่า` int(3) NOT NULL,
  `เลขที่ใบแจ้งหนี้` bigint(10) NOT NULL,
  `วัน_เดือน_ปีที่ออกใบแจ้งหนี้` date NOT NULL,
  `ยอดเงินสุทธิ` float(10,2) NOT NULL,
  `ยอดเงินที่ชำระ` float(10,2) NOT NULL,
  `สถานะการชำระเงิน` int(2) NOT NULL
) ENGINE=InnoDB DEFAULT CHARSET=utf8mb4;

--
-- Dumping data for table `ใบแจ้งหนี้`
--

INSERT INTO `ใบแจ้งหนี้` (`เลขที่ห้องเช่า`, `เลขที่ใบแจ้งหนี้`, `วัน_เดือน_ปีที่ออกใบแจ้งหนี้`, `ยอดเงินสุทธิ`, `ยอดเงินที่ชำระ`, `สถานะการชำระเงิน`) VALUES
(104, 1045122022, '2022-12-05', 2407.00, 2407.00, 1),
(101, 10125112022, '2022-11-25', 2910.00, 2000.00, 2),
(102, 10225112022, '2022-11-25', 3013.00, 0.00, 2),
(103, 10325112022, '2022-11-25', 4000.00, 4000.00, 1),
(201, 20116112022, '2022-11-16', 3075.00, 3075.00, 1),
(202, 20225112022, '2022-11-25', 2967.00, 2967.00, 1),
(204, 20425112022, '2022-11-25', 3000.00, 3000.00, 1);

--
-- Indexes for dumped tables
--

--
-- Indexes for table `การใช้น้ำใช้ไฟ`
--
ALTER TABLE `การใช้น้ำใช้ไฟ`
  ADD PRIMARY KEY (`เลขที่ห้องเช่า`,`วัน_เดือน_ปีที่จด`);

--
-- Indexes for table `ลูกค้า`
--
ALTER TABLE `ลูกค้า`
  ADD PRIMARY KEY (`เลขบัตรประชาชน`),
  ADD KEY `เลขที่ห้องเช่า` (`เลขที่ห้องเช่า`);

--
-- Indexes for table `ห้องเช่า`
--
ALTER TABLE `ห้องเช่า`
  ADD PRIMARY KEY (`เลขที่ห้องเช่า`);

--
-- Indexes for table `ใบเสร็จ`
--
ALTER TABLE `ใบเสร็จ`
  ADD PRIMARY KEY (`เลขที่ใบเสร็จ`),
  ADD KEY `เลขที่ห้องเช่า` (`เลขที่ห้องเช่า`),
  ADD KEY `เลขที่ใบแจ้งหนี้` (`เลขที่ใบแจ้งหนี้`);

--
-- Indexes for table `ใบแจ้งหนี้`
--
ALTER TABLE `ใบแจ้งหนี้`
  ADD PRIMARY KEY (`เลขที่ใบแจ้งหนี้`),
  ADD KEY `เลขที่ห้องเช่า` (`เลขที่ห้องเช่า`);

--
-- Constraints for dumped tables
--

--
-- Constraints for table `การใช้น้ำใช้ไฟ`
--
ALTER TABLE `การใช้น้ำใช้ไฟ`
  ADD CONSTRAINT `การใช้น้ำใช้ไฟ_ibfk_1` FOREIGN KEY (`เลขที่ห้องเช่า`) REFERENCES `ห้องเช่า` (`เลขที่ห้องเช่า`);

--
-- Constraints for table `ลูกค้า`
--
ALTER TABLE `ลูกค้า`
  ADD CONSTRAINT `ลูกค้า_ibfk_1` FOREIGN KEY (`เลขที่ห้องเช่า`) REFERENCES `ห้องเช่า` (`เลขที่ห้องเช่า`);

--
-- Constraints for table `ใบเสร็จ`
--
ALTER TABLE `ใบเสร็จ`
  ADD CONSTRAINT `ใบเสร็จ_ibfk_1` FOREIGN KEY (`เลขที่ห้องเช่า`) REFERENCES `ห้องเช่า` (`เลขที่ห้องเช่า`),
  ADD CONSTRAINT `ใบเสร็จ_ibfk_2` FOREIGN KEY (`เลขที่ใบแจ้งหนี้`) REFERENCES `ใบแจ้งหนี้` (`เลขที่ใบแจ้งหนี้`);

--
-- Constraints for table `ใบแจ้งหนี้`
--
ALTER TABLE `ใบแจ้งหนี้`
  ADD CONSTRAINT `ใบแจ้งหนี้_ibfk_1` FOREIGN KEY (`เลขที่ห้องเช่า`) REFERENCES `ห้องเช่า` (`เลขที่ห้องเช่า`);
COMMIT;

/*!40101 SET CHARACTER_SET_CLIENT=@OLD_CHARACTER_SET_CLIENT */;
/*!40101 SET CHARACTER_SET_RESULTS=@OLD_CHARACTER_SET_RESULTS */;
/*!40101 SET COLLATION_CONNECTION=@OLD_COLLATION_CONNECTION */;
